let a = 1 * '4' + +null + +' ' - '5' * 2 + +(7 + 2 + '' + +!!undefined);

// 1. 1 * '4' = 4
// '4' เป็น string แต่เมื่อมีการคูณกับเลข 1, JavaScript จะทำการแปลง '4' เป็นตัวเลข

// 2. +null = 0
// + ที่นำหน้า null จะแปลง null เป็นเลข 0

// 3. + `` = 0
// สตริงที่มีช่องว่าง (space) '' จะแปลงเป็น 0 เมื่อใช้เครื่องหมาย +

// 4. '5' * 2 = 10
// '5' เป็น string แต่เมื่อคูณกับตัวเลข JavaScript จะทำการแปลง '5' เป็นตัวเลข

// 5. +(7 + 2 + '' + +!!undefined) = 90
// 7 + 2 = 9 (บวกเลขปกติ).
// '' คือ string ว่าง ทำให้การบวกเลขกับ string ทำให้ 9 กลายเป็น "9" (string)
// +!!undefined: !!undefined จะได้เป็น false, และเมื่อใช้ + จะแปลง false เป็น 0
// ดังนั้น (7 + 2 + '' + +!!undefined) จะได้ "9" + 0 = "90"
// เมื่อใช้ + ที่นำหน้า "90" จะทำให้ string "90" ถูกแปลงเป็นตัวเลข
